# 不一致 / 特定条件に合致しない行を抽出する（!=）（level1）
# レシート明細データから売上年月日（sales_ymd）、顧客ID（customer_id）、商品コード（product_cd）、売上金額（amount）の順に列を指定し、以下の条件を満たすデータを抽出せよ。
# 条件1: 顧客ID（customer_id）が"CS018205000001"
# 条件2: 商品コード（product_cd）が"P071401019"以外
library(tidyverse)

df_receipt <- read_csv("./data/receipt.csv")
df_receipt |> 
    select(sales_ymd, customer_id, product_cd, amount) |>
    filter(
        customer_id == "CS018205000001",
        product_cd != "P071401019"
    )

# A tibble: 12 × 4
#    sales_ymd customer_id    product_cd amount
#        <dbl> <chr>          <chr>       <dbl>
#  1  20180911 CS018205000001 P071401012   2200
#  2  20180414 CS018205000001 P060104007    600
#  3  20170614 CS018205000001 P050206001    990
#  4  20170614 CS018205000001 P060702015    108
#  5  20190216 CS018205000001 P071005024    102
#  6  20180414 CS018205000001 P071101002    278
#  7  20190226 CS018205000001 P070902035    168
#  8  20190924 CS018205000001 P060805001    495
#  9  20190226 CS018205000001 P071401020   2200
# 10  20180911 CS018205000001 P071401005   1100
# 11  20190216 CS018205000001 P040101002    218
# 12  20190924 CS018205000001 P091503001    280